&После("ДобавитьКомандыПечати")
Процедура PayQR_ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НакладнаяQR";
	КомандаПечати.Представление = НСтр("ru = 'Накладная с QR'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 14;
	
КонецПроцедуры

&После("Печать")
Процедура PayQR_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяQR") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"НакладнаяQR",
			НСтр("ru = 'Накладная с QR'"),
			PayQR_ПечатьНакладнойQR(МассивОбъектов, ОбъектыПечати),,
			"Документ.РеализацияТоваровУслуг.ПФ_MXL_Накладная_QR");
	КонецЕсли;
	
КонецПроцедуры    

Функция PayQR_ПечатьНакладнойQR(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "РеализацияТоваровУслуг_Накладная";
	
	ПечататьАртикулВНакладной = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ПечататьАртикулВНакладной");
    ПечататьШтрихкодВНакладной = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ПечататьШтрихкодВНакладной");

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_Накладная_QR");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.Номер КАК Номер,
		|	ТаблицаДокумента.Дата КАК Дата,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Организация.НаименованиеПолное КАК ОрганизацияПредставление,
		|	ТаблицаДокумента.ВалютаДокумента КАК ВалютаДокумента,
		|	ТаблицаДокумента.Склад КАК Склад,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.Склад) КАК СкладПредставление,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Контрагент.НаименованиеПолное КАК КонтрагентПредставление,
		|	ТаблицаДокумента.ДоговорКонтрагента.Наименование КАК ДоговорКонтрагентаНаименование,
		|	ТаблицаДокумента.ВыводитьКомментарийВНаименование КАК ВыводитьКомментарийВНаименование,
		|	ТаблицаДокумента.Комментарий КАК Комментарий,
		|	ТаблицаДокумента.ТочностьЦены КАК ТочностьЦены,
		|	ТаблицаДокумента.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
		|	ТаблицаДокумента.ВыводитьДоговорВПФ КАК ВыводитьДоговорВПФ,
		|	ТаблицаДокумента.ОС.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ОсновноеСредство КАК ОсновноеСредство,
		|		ИнвентарныйНомер КАК ИнвентарныйНомер,
		|		1 КАК Количество,
		|		""ед."" КАК ЕИ,
		|		Сумма КАК Цена,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаНСП КАК СуммаНСП,
		|		СуммаДохода КАК СуммаДохода,
		|		Всего КАК Всего,
		|		ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		|		СуммаСкидки КАК СуммаСкидки,
		|		СчетДоходов КАК СчетДоходов,
		|		СчетЗатрат КАК СчетЗатрат,
		|		СтатьяЗатрат КАК СтатьяЗатрат,
		|		ОсновноеСредство.НаименованиеПолное КАК НоменклатураПредставление,
		|		ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.ОС.ОсновноеСредство.КодТНВЭД) КАК КодПоКлассификатору
		|	) КАК ОС
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&СписокДокументов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокументаТовары.Ссылка КАК Ссылка,
		|	ТаблицаДокументаТовары.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокументаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаДокументаТовары.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ТаблицаДокументаТовары.Ссылка.ВыводитьЦенуСНалогами
		|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокументаТовары.Всего / ТаблицаДокументаТовары.Количество КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ТаблицаДокументаТовары.Цена
		|	КОНЕЦ КАК Цена,
		|	ТаблицаДокументаТовары.СуммаНДС КАК СуммаНДС,
		|	ТаблицаДокументаТовары.СуммаНСП КАК СуммаНСП,
		|	ТаблицаДокументаТовары.СуммаСкидки КАК СуммаСкидки,
		|	ТаблицаДокументаТовары.Всего КАК Всего,
		|	ТаблицаДокументаТовары.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаТовары.Номенклатура.КодТНВЭД) КАК КодПоКлассификатору,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаТовары.Номенклатура.ЕдиницаИзмерения) КАК ЕИ,
		|	ВЫБОР
		|		КОГДА &ПечататьАртикулВНакладной
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаТовары.Номенклатура.Артикул)
		|	КОНЕЦ КАК Артикул,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА &ПечататьШтрихкодВНакладной
		|				ТОГДА ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, 0)
		|		КОНЕЦ) КАК Штрихкод
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаДокументаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ТаблицаДокументаТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|ГДЕ
		|	ТаблицаДокументаТовары.Ссылка В(&СписокДокументов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокументаТовары.Ссылка,
		|	ТаблицаДокументаТовары.Номенклатура,
		|	ТаблицаДокументаТовары.НомерСтроки,
		|	ТаблицаДокументаТовары.Количество,
		|	ТаблицаДокументаТовары.СуммаНДС,
		|	ТаблицаДокументаТовары.СуммаНСП,
		|	ТаблицаДокументаТовары.СуммаСкидки,
		|	ТаблицаДокументаТовары.Всего,
		|	ТаблицаДокументаТовары.Номенклатура.НаименованиеПолное,
		|	ВЫБОР
		|		КОГДА ТаблицаДокументаТовары.Ссылка.ВыводитьЦенуСНалогами
		|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокументаТовары.Всего / ТаблицаДокументаТовары.Количество КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ТаблицаДокументаТовары.Цена
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаТовары.Номенклатура.КодТНВЭД),
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаТовары.Номенклатура.ЕдиницаИзмерения),
		|	ВЫБОР
		|		КОГДА &ПечататьАртикулВНакладной
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаТовары.Номенклатура.Артикул)
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокументаУслуги.Ссылка КАК Ссылка,
		|	ТаблицаДокументаУслуги.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокументаУслуги.Номенклатура КАК Номенклатура,
		|	ТаблицаДокументаУслуги.Количество КАК Количество,
		|	ТаблицаДокументаУслуги.СуммаНДС КАК СуммаНДС,
		|	ТаблицаДокументаУслуги.СуммаНСП КАК СуммаНСП,
		|	ТаблицаДокументаУслуги.СуммаСкидки КАК СуммаСкидки,
		|	ТаблицаДокументаУслуги.Всего КАК Всего,
		|	ВЫБОР
		|		КОГДА ТаблицаДокументаУслуги.Ссылка.ВыводитьЦенуСНалогами
		|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокументаУслуги.Всего / ТаблицаДокументаУслуги.Количество КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ТаблицаДокументаУслуги.Цена
		|	КОНЕЦ КАК Цена,
		|	ТаблицаДокументаУслуги.Номенклатура.Артикул КАК Артикул,
		|	МИНИМУМ(ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, 0)) КАК Штрихкод,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаУслуги.Номенклатура.КодГКЭД) КАК КодПоКлассификатору,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаУслуги.Номенклатура.ЕдиницаИзмерения) КАК ЕИ,
		|	ТаблицаДокументаУслуги.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК ТаблицаДокументаУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ТаблицаДокументаУслуги.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|ГДЕ
		|	ТаблицаДокументаУслуги.Ссылка В(&СписокДокументов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокументаУслуги.Ссылка,
		|	ТаблицаДокументаУслуги.Номенклатура,
		|	ТаблицаДокументаУслуги.НомерСтроки,
		|	ТаблицаДокументаУслуги.Количество,
		|	ТаблицаДокументаУслуги.СуммаНДС,
		|	ТаблицаДокументаУслуги.СуммаНСП,
		|	ТаблицаДокументаУслуги.СуммаСкидки,
		|	ТаблицаДокументаУслуги.Всего,
		|	ТаблицаДокументаУслуги.Номенклатура.Артикул,
		|	ВЫБОР
		|		КОГДА ТаблицаДокументаУслуги.Ссылка.ВыводитьЦенуСНалогами
		|			ТОГДА ВЫРАЗИТЬ(ТаблицаДокументаУслуги.Всего / ТаблицаДокументаУслуги.Количество КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ТаблицаДокументаУслуги.Цена
		|	КОНЕЦ,
		|	ТаблицаДокументаУслуги.Номенклатура.НаименованиеПолное,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаУслуги.Номенклатура.КодГКЭД),
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументаУслуги.Номенклатура.ЕдиницаИзмерения)";		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	Запрос.УстановитьПараметр("ПечататьАртикулВНакладной", ПечататьАртикулВНакладной);
	Запрос.УстановитьПараметр("ПечататьШтрихкодВНакладной", ПечататьШтрихкодВНакладной);
	
	МассивРезультатов = Запрос.ВыполнитьПакет(); 
	
	Шапка = МассивРезультатов[0].Выбрать();
	ВыгрузкаТовары = МассивРезультатов[1].Выгрузить();
	ВыгрузкаУслуги = МассивРезультатов[2].Выгрузить();
		
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;	
		
		ТекстЗаголовка = СформироватьЗаголовокДокумента(Шапка, НСтр("ru = 'Накладная на реализацию'"));
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("ОрганизацияПредставление", Шапка.ОрганизацияПредставление); 	
		ДанныеПечати.Вставить("СкладПредставление", Шапка.СкладПредставление); 
		
		ДанныеПечати.Вставить("ПолучательПредставление", Шапка.КонтрагентПредставление
		+ ?(Шапка.ВыводитьДоговорВПФ, ", " + "Договор "	+ Шапка.ДоговорКонтрагентаНаименование, "")); 
		
		ДанныеПечати.Вставить("Комментарий", Шапка.Комментарий);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", Шапка.Ссылка);
		
		МассивТовары = ВыгрузкаТовары.НайтиСтроки(Отбор);
		ТаблицаТовары = ВыгрузкаТовары.Скопировать(МассивТовары);
		
		МассивУслуги = ВыгрузкаУслуги.НайтиСтроки(Отбор);
		ТаблицаУслуги = ВыгрузкаУслуги.Скопировать(МассивУслуги);
		
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаТовары.Количество() > 0
			Или ТаблицаОС.Количество() > 0 Тогда 
			ДанныеПечати.Вставить("НаименованиеКлассификатора", НСтр("ru = 'Код ТНВЭД'"));
		ИначеЕсли ТаблицаУслуги.Количество() > 0 Тогда  
			ДанныеПечати.Вставить("НаименованиеКлассификатора", НСтр("ru = 'Код ГКЭД'"));	
		КонецЕсли;	
		
		Всего = ТаблицаТовары.Итог("Всего") + ТаблицаУслуги.Итог("Всего") + ТаблицаОС.Итог("Всего");
		ВсегоНДС = ТаблицаТовары.Итог("СуммаНДС") + ТаблицаУслуги.Итог("СуммаНДС") + ТаблицаОС.Итог("СуммаНДС");
		ВсегоНСП = ТаблицаТовары.Итог("СуммаНСП") + ТаблицаУслуги.Итог("СуммаНСП") + ТаблицаОС.Итог("СуммаНСП");
		КоличествоНаименований = ТаблицаТовары.Количество() + ТаблицаУслуги.Количество() + ТаблицаОС.Количество();		
		
		ВсегоСкидка = ТаблицаТовары.Итог("СуммаСкидки") + ТаблицаУслуги.Итог("СуммаСкидки") + ТаблицаОС.Итог("СуммаСкидки");
		ЕстьСкидка = ВсегоСкидка <> 0;
		ИтогоКОплате = Всего - ВсегоСкидка;
		
		ДанныеПечати.Вставить("ИтогоКОплате", ИтогоКОплате);
		
		ДанныеПечати.Вставить("Всего", Всего);
		ДанныеПечати.Вставить("ВсегоНДС", ВсегоНДС);
		ДанныеПечати.Вставить("ВсегоНСП", ВсегоНСП);
		ДанныеПечати.Вставить("ВсегоСкидка", ВсегоСкидка);
		ДанныеПечати.Вставить("ИтоговаяСтрока", 
			СтрШаблон(НСтр("ru = 'Всего наименований %1, на сумму %2'"), 
			Формат(КоличествоНаименований, "ЧН=0; ЧГ=0"), Формат(ДанныеПечати.ИтогоКОплате, "ЧЦ=15; ЧДЦ=2")));
		ДанныеПечати.Вставить("СуммаПрописью", БухгалтерскийУчетСервер.СформироватьСуммуПрописью(ДанныеПечати.ИтогоКОплате, Шапка.ВалютаДокумента));

		ДанныеЦены = Новый Структура();
		ДанныеЦены.Вставить("Цена", 0);
		
		// Области
		МассивОбластейМакета = Новый Массив;
		МассивОбластейМакета.Добавить("Заголовок");
		Если Шапка.ВыводитьКомментарийВНаименование Тогда
			МассивОбластейМакета.Добавить("Комментарий");
		КонецЕсли; 
				
		Если ПечататьАртикулВНакладной И ПечататьШтрихкодВНакладной И ЕстьСкидка Тогда
			ШапкаТаблицы = "ШапкаТаблицыСоСкидкойАртикулШтрихкод";
			Строка		 = "СтрокаСоСкидкойАртикулШтрихкод";
		ИначеЕсли ПечататьШтрихкодВНакладной И ЕстьСкидка Тогда
			ШапкаТаблицы = "ШапкаТаблицыСоСкидкойШтрихкод";
			Строка		 = "СтрокаСоСкидкойШтрихкод";
		ИначеЕсли ПечататьАртикулВНакладной И ЕстьСкидка Тогда
			ШапкаТаблицы = "ШапкаТаблицыСоСкидкойАртикул";
			Строка		 = "СтрокаСоСкидкойАртикул";
		ИначеЕсли ПечататьАртикулВНакладной И ПечататьШтрихкодВНакладной Тогда
			ШапкаТаблицы = "ШапкаТаблицыАртикулШтрихкод";
			Строка		 = "СтрокаАртикулШтрихкод";
		ИначеЕсли ЕстьСкидка Тогда
			ШапкаТаблицы = "ШапкаТаблицыСоСкидкой";
			Строка		 = "СтрокаСоСкидкой";	
		ИначеЕсли ПечататьШтрихкодВНакладной Тогда
			ШапкаТаблицы = "ШапкаТаблицыШтрихкод";
			Строка		 = "СтрокаШтрихкод";
		ИначеЕсли ПечататьАртикулВНакладной Тогда
			ШапкаТаблицы = "ШапкаТаблицыАртикул";
			Строка		 = "СтрокаАртикул";	
		Иначе
			ШапкаТаблицы = "ШапкаТаблицы";
			Строка		 = "Строка";
		КонецЕсли;
		
		МассивОбластейМакета.Добавить(ШапкаТаблицы);
		МассивОбластейМакета.Добавить(Строка);
		
		МассивОбластейМакета.Добавить("Подвал");
		МассивОбластейМакета.Добавить("Итоги");
		Если ЕстьСкидка Тогда 
			МассивОбластейМакета.Добавить("ИтогиСкидка");
		КонецЕсли;
		МассивОбластейМакета.Добавить("ИтогоКОплате");
		МассивОбластейМакета.Добавить("ИтогиНДС");
		МассивОбластейМакета.Добавить("ИтогиНСП");
		МассивОбластейМакета.Добавить("СуммаПрописью");
		
		ФайлФаксимильнаяПечать = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлФаксимильнаяПечать");
		Если ЗначениеЗаполнено(ФайлФаксимильнаяПечать) Тогда
			ДанныеПечати.Вставить("ФайлФаксимильнаяПечать", Шапка.ФайлФаксимильнаяПечать);
			МассивОбластейМакета.Добавить("ПодписиСФаксимиле");	
		Иначе
		    МассивОбластейМакета.Добавить("Подписи");
		КонецЕсли;
		
		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
						
			Если ИмяОбласти = "ПодписиСФаксимиле" Тогда
				// Вывод печати.
				Если ЗначениеЗаполнено(ДанныеПечати.ФайлФаксимильнаяПечать) Тогда 
					ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ДанныеПечати.ФайлФаксимильнаяПечать);
					Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
						ОбластьМакета.Рисунки.ПечатьОрганизации.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
						ОбластьМакета.Рисунки.ПечатьОрганизации.Картинка = Новый Картинка(ДвоичныеДанные);
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
			Если СтрЧислоВхождений(ИмяОбласти, "Строка") > 0 Тогда
				Для Каждого СтрокаТаблицы Из ТаблицаТовары Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					
					Если ИмяОбласти <> "СтрокаАртикулШтрихкод" Тогда
						ДанныеЦены.Цена = Формат(СтрокаТаблицы.Цена, "ЧЦ=23; ЧДЦ=" + Шапка.ТочностьЦены +" ; ЧГ=3,0");
					Иначе
						ДанныеЦены.Цена = СтрокаТаблицы.Цена;
					КонецЕсли;
					ОбластьМакета.Параметры.Заполнить(ДанныеЦены);
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;
				Для Каждого СтрокаТаблицы Из ТаблицаУслуги Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					
					Если ИмяОбласти <> "СтрокаАртикулШтрихкод" Тогда
						ДанныеЦены.Цена = Формат(СтрокаТаблицы.Цена, "ЧЦ=23; ЧДЦ=" + Шапка.ТочностьЦены +" ; ЧГ=3,0");
					Иначе
						ДанныеЦены.Цена = СтрокаТаблицы.Цена;
					КонецЕсли;
					ОбластьМакета.Параметры.Заполнить(ДанныеЦены);
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;
				Для Каждого СтрокаТаблицы Из ТаблицаОС Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
										
					ДанныеЦены.Цена = Формат(СтрокаТаблицы.Цена, "ЧЦ=23; ЧДЦ=" + Шапка.ТочностьЦены +" ; ЧГ=3,0");
					ОбластьМакета.Параметры.Заполнить(ДанныеЦены);
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;
				
			Иначе 
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);	
			КонецЕсли;	
		КонецЦикла;
		
		БухгалтерскиеОтчеты.ВыводПодписиРуководителей(ТабличныйДокумент, Шапка);  
		
		// Вывод QR.
		PayQR_ВывестиQRCodeПоНастройкам(
			ТабличныйДокумент,
			Макет,
			Шапка.Ссылка,
			Шапка.Номер,
			ДанныеПечати.ИтогоКОплате,
			PayQR_КодКлиентаTiger(Шапка.Контрагент));	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// QR-коды вынесены в ОбщийМодуль.PayQR_ПечатьНакладнойQR.
////////////////////////////////////////////////////////////////////////////////

Процедура PayQR_ВывестиQRCodeПоНастройкам(
	ТабличныйДокумент,
	Макет,
	ДокументСсылка,
	НомерДокумента,
	СуммаДокумента,
	КодКлиентаTiger)

	PayQR_ПечатьНакладнойQR.PayQR_ВывестиQRCodeПоНастройкам(
		ТабличныйДокумент,
		Макет,
		ДокументСсылка,
		НомерДокумента,
		СуммаДокумента,
		КодКлиентаTiger);

КонецПроцедуры

Функция PayQR_КодКлиентаTiger(Контрагент)

	Возврат PayQR_ПечатьНакладнойQR.PayQR_КодКлиентаTiger(Контрагент);

КонецФункции

