&НаСервере
Процедура PayQR_ПоказатьМетаданныеПлатежногоПоручения() Экспорт

	Сообщить("PayQR: реквизиты Документ.ПлатежноеПоручениеВходящее");

	Для Каждого Реквизит Из Метаданные.Документы.ПлатежноеПоручениеВходящее.Реквизиты Цикл
		Сообщить("Реквизит: " + Реквизит.Имя);
	КонецЦикла;

	Для Каждого ТабличнаяЧасть Из Метаданные.Документы.ПлатежноеПоручениеВходящее.ТабличныеЧасти Цикл
		Сообщить("Табличная часть: " + ТабличнаяЧасть.Имя);
		Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
			Сообщить("  Реквизит ТЧ: " + ТабличнаяЧасть.Имя + "." + РеквизитТЧ.Имя);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
